import { Injectable } from '@angular/core';
import { Maid } from '../Models/Maid';

@Injectable({
  providedIn: 'root',
})
export class MaidServicesService {
  private maids: Maid[] = [
    {
      id: 1,
      name: 'Kirstie Medina',
      age: 22,
      job: 'عامله نظافه',
      rel: 'غير محدد',
      nat: 'صينيه',
      notes: ['هذه هي المرة الاولي لها في المملكه'],
      skills: [
        'إجادة الطبخ والتنظيف',
        'معامله الاطفال',
        'نظافة وتدبير المنزل',
        'التعامل مع كبار السن',
        'إجاده اللغه العربيه',
        'إجاده اللغه الإنجليزيه',
      ],
    },
    {
      id: 2,
      name: 'Lynden Giles',
      age: 20,
      job: 'عامله نظافه',
      rel: 'غير محدد',
      nat: 'ماليزيه',
      notes: [],
      skills: [
        'إجادة الطبخ والتنظيف',
        'معامله الاطفال',
        'نظافة وتدبير المنزل',
        'التعامل مع كبار السن',
        'إجاده اللغه العربيه',
        'إجاده اللغه الإنجليزيه',
      ],
    },
    {
      id: 3,
      name: 'Miley Mcghee',
      age: 30,
      job: 'عامله نظافه',
      rel: 'غير محدد',
      nat: 'تايونيه',
      notes: [],
      skills: [
        'إجادة الطبخ والتنظيف',
        'معامله الاطفال',
        'نظافة وتدبير المنزل',
        'التعامل مع كبار السن',
        'إجاده اللغه العربيه',
        'إجاده اللغه الإنجليزيه',
      ],
    },
    {
      id: 4,
      name: 'Kaira Lowry',
      age: 28,
      job: 'عامله نظافه',
      rel: 'غير محدد',
      nat: 'صينيه',
      notes: [],
      skills: [
        'إجادة الطبخ والتنظيف',
        'معامله الاطفال',
        'نظافة وتدبير المنزل',
        'التعامل مع كبار السن',
        'إجاده اللغه العربيه',
        'إجاده اللغه الإنجليزيه',
      ],
    },
    {
      id: 5,
      name: 'Jessica Williams',
      age: 25,
      job: 'عامله نظافه',
      rel: 'غير محدد',
      nat: 'إندونيسيه',
      notes: [],
      skills: [
        'إجادة الطبخ والتنظيف',
        'معامله الاطفال',
        'نظافة وتدبير المنزل',
        'التعامل مع كبار السن',
        'إجاده اللغه العربيه',
        'إجاده اللغه الإنجليزيه',
      ],
    },
    {
      id: 6,
      name: 'Emily Johnson',
      age: 35,
      job: 'عامله نظافه',
      rel: 'غير محدد',
      nat: 'صينيه',
      notes: [],
      skills: [
        'إجادة الطبخ والتنظيف',
        'معامله الاطفال',
        'نظافة وتدبير المنزل',
        'التعامل مع كبار السن',
        'إجاده اللغه العربيه',
        'إجاده اللغه الإنجليزيه',
      ],
    },
  ];

  constructor() {}

  getAllMaid() {
    console.log(this.maids);
    
    return [...this.maids];
  }
}
